In [1]:
#Pandas : Open source Library == Data Mnipulations
# Data Struture : 1. Series   2. Data Frame

#1. Series ==> 1-D dataset-- we can get only values
#2. Data fRAME ==> 2-D dataset--- we can get label name with values

In [2]:
import pandas as pd

In [3]:
a={
    "emp_id": [1,2,3,4,5,6],
    "Name"  : ['Jesty','Neha','Anjali','Pooja','Manvi','Ani'],
    "Department": ['HR','IT','IT','HR','Operations','IT'],
    "Working_hours": [8,7,8,9,9,6],
    "Salary": [30000,35000,38000,45000,560000,55000]
    
}

In [4]:
type(a)

dict

In [5]:
df = pd.DataFrame(a)
df

   emp_id    Name  Department  Working_hours  Salary
0       1   Jesty          HR              8   30000
1       2    Neha          IT              7   35000
2       3  Anjali          IT              8   38000
3       4   Pooja          HR              9   45000
4       5   Manvi  Operations              9  560000
5       6     Ani          IT              6   55000

# How to save this Dataframe into excel?

In [6]:
df.to_csv("C:\\Users\\jyoti\\OneDrive\\Desktop\\New folder\\emp_info.csv",index=False) #csv = comma separated vale

# How to read/upload a csv file into jupyter using pandas ?

In [7]:
df =pd.read_csv("C:\\Users\\jyoti\\OneDrive\\Desktop\\New folder\\emp_info.csv")

In [8]:
df

   emp_id    Name  Department  Working_hours  Salary
0       1   Jesty          HR              8   30000
1       2    Neha          IT              7   35000
2       3  Anjali          IT              8   38000
3       4   Pooja          HR              9   45000
4       5   Manvi  Operations              9  560000
5       6     Ani          IT              6   55000

In [9]:
a={
    "emp_id": [1,2,3,4,5,6],
    "Name"  : ['Jesty','Neha','Anjali','Pooja','Manvi','Ani'],
    "Department": ['HR','IT','IT','HR','Operations','IT'],
    "Working_hours": [8,7,8,9,9,6],
    "Salary": [30000,35000,38000,45000,560000,55000]
    
}

# How to read top 5 data using Pandas ?

In [10]:
df.head() # by default giving top 5 data

   emp_id    Name  Department  Working_hours  Salary
0       1   Jesty          HR              8   30000
1       2    Neha          IT              7   35000
2       3  Anjali          IT              8   38000
3       4   Pooja          HR              9   45000
4       5   Manvi  Operations              9  560000

In [11]:
df.head(2)

   emp_id   Name Department  Working_hours  Salary
0       1  Jesty         HR              8   30000
1       2   Neha         IT              7   35000

# How to get bottom 5 data ?

In [12]:
df.tail()  #bottom data

   emp_id    Name  Department  Working_hours  Salary
1       2    Neha          IT              7   35000
2       3  Anjali          IT              8   38000
3       4   Pooja          HR              9   45000
4       5   Manvi  Operations              9  560000
5       6     Ani          IT              6   55000

In [13]:
df.tail(3)

   emp_id   Name  Department  Working_hours  Salary
3       4  Pooja          HR              9   45000
4       5  Manvi  Operations              9  560000
5       6    Ani          IT              6   55000

# How to get random index dataset?

In [14]:
df.sample(3)

   emp_id    Name Department  Working_hours  Salary
3       4   Pooja         HR              9   45000
5       6     Ani         IT              6   55000
2       3  Anjali         IT              8   38000

In [15]:
df.columns # all columns of data

Index(['emp_id', 'Name', 'Department', 'Working_hours', 'Salary'], dtype='object')

In [16]:
df.axes # starting and ending piont of data

[RangeIndex(start=0, stop=6, step=1),
 Index(['emp_id', 'Name', 'Department', 'Working_hours', 'Salary'], dtype='object')]

In [17]:
df.info() # complete overview of data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   emp_id         6 non-null      int64
 1   Name           6 non-null      object
 2   Department     6 non-null      object
 3   Working_hours  6 non-null      int64
 4   Salary         6 non-null      int64
dtypes: int64(3), object(2)
memory usage: 372.0+ bytes

In [18]:
df.describe()  # we can check statically view of data

         emp_id  Working_hours         Salary
count  6.000000       6.000000       6.000000
mean   3.500000       7.833333  127166.666667
std    1.870829       1.169045  212221.974985
min    1.000000       6.000000   30000.000000
25%    2.250000       7.250000   35750.000000
50%    3.500000       8.000000   41500.000000
75%    4.750000       8.750000   52500.000000
max    6.000000       9.000000  560000.000000

In [19]:
df['Department']

0            HR
1            IT
2            IT
3            HR
4    Operations
5            IT
Name: Department, dtype: object

In [20]:
df['Department'].value_counts()  #value.count - find the total same dep.

Department
IT            3
HR            2
Operations    1
Name: count, dtype: int64

In [21]:
#DATA FRAME === MUTUABLE

In [22]:
df['Name'][0]='RAJ'

C:\Users\jyoti\AppData\Local\Temp\ipykernel_2044\1521285029.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][0]='RAJ'

In [23]:
df

   emp_id    Name  Department  Working_hours  Salary
0       1     RAJ          HR              8   30000
1       2    Neha          IT              7   35000
2       3  Anjali          IT              8   38000
3       4   Pooja          HR              9   45000
4       5   Manvi  Operations              9  560000
5       6     Ani          IT              6   55000

In [24]:
#loc and iloc ==> data extraction
#df.loc [row_number ,column name]==> starting value+last value include
#df.iloc [row_number ,column range]==> starting value+last value excluded

In [25]:
df.loc[2:5,['Name','Department','Salary']]

     Name  Department  Salary
2  Anjali          IT   38000
3   Pooja          HR   45000
4   Manvi  Operations  560000
5     Ani          IT   55000

In [26]:
df.iloc[2:5,[1,2,4]]

     Name  Department  Salary
2  Anjali          IT   38000
3   Pooja          HR   45000
4   Manvi  Operations  560000

In [27]:
#Task==>

#department ==> operations==> interns, salary=10000, working hours=8

In [28]:
df['Department'][4] = 'Interns'

C:\Users\jyoti\AppData\Local\Temp\ipykernel_2044\970346860.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Department'][4] = 'Interns'

In [29]:
df

   emp_id    Name Department  Working_hours  Salary
0       1     RAJ         HR              8   30000
1       2    Neha         IT              7   35000
2       3  Anjali         IT              8   38000
3       4   Pooja         HR              9   45000
4       5   Manvi    Interns              9  560000
5       6     Ani         IT              6   55000

In [30]:
#df['Working hours']='8'

In [31]:
df

   emp_id    Name Department  Working_hours  Salary
0       1     RAJ         HR              8   30000
1       2    Neha         IT              7   35000
2       3  Anjali         IT              8   38000
3       4   Pooja         HR              9   45000
4       5   Manvi    Interns              9  560000
5       6     Ani         IT              6   55000

In [35]:
df['Working_hours'][4]=8

In [36]:
df

   emp_id    Name Department Working_hours  Salary
0       1     RAJ         HR             8   30000
1       2    Neha         IT             7   35000
2       3  Anjali         IT             8   38000
3       4   Pooja         HR             9   45000
4       5   Manvi    Interns             8  560000
5       6     Ani         IT             6   55000